{
    "add_bos_token": true,
    "add_eos_token": false,
    "added_tokens_decoder": {
        "0": {
            "content": "<unk>",
            "lstrip": false,
            "normalized": false,
            "rstrip": false,
            "single_word": false,
            "special": true
        },
        "1": {
            "content": "<s>",
            "lstrip": false,
            "normalized": false,
            "rstrip": false,
            "single_word": false,
            "special": true
        },
        "2": {
            "content": "</s>",
            "lstrip": false,
            "normalized": false,
            "rstrip": false,
            "single_word": false,
            "special": true
        },
        "32007": {
            "content": "\u2581<PRE>",
            "lstrip": false,
            "normalized": false,
            "rstrip": false,
            "single_word": false,
            "special": true
        },
        "32008": {
            "content": "\u2581<SUF>",
            "lstrip": false,
            "normalized": false,
            "rstrip": false,
            "single_word": false,
            "special": true
        },
        "32009": {
            "content": "\u2581<MID>",
            "lstrip": false,
            "normalized": false,
            "rstrip": false,
            "single_word": false,
            "special": true
        },
        "32010": {
            "content": "\u2581<EOT>",
            "lstrip": false,
            "normalized": false,
            "rstrip": false,
            "single_word": false,
            "special": true
        }
    },
    "additional_special_tokens": [
        "\u2581<PRE>",
        "\u2581<MID>",
        "\u2581<SUF>",
        "\u2581<EOT>"
    ],
    "bos_token": "<s>",
    "clean_up_tokenization_spaces": false,
    "eos_token": "</s>",
    "eot_token": "\u2581<EOT>",
    "extra_special_tokens": {},
    "fill_token": "<FILL_ME>",
    "legacy": null,
    "middle_token": "\u2581<MID>",
    "model_max_length": 1000000000000000019884624838656,
    "pad_token": null,
    "prefix_token": "\u2581<PRE>",
    "sp_model_kwargs": {},
    "suffix_token": "\u2581<SUF>",
    "tokenizer_class": "CodeLlamaTokenizer",
    "unk_token": "<unk>",
    "use_default_system_prompt": false
}
