{
    "add_bos_token": false,
    "add_eos_token": false,
    "add_prefix_space": false,
    "added_tokens_decoder": {
        "0": {
            "content": "<|endoftext|>",
            "lstrip": false,
            "normalized": false,
            "rstrip": false,
            "single_word": false,
            "special": true
        },
        "1": {
            "content": "<|padding|>",
            "lstrip": false,
            "normalized": false,
            "rstrip": false,
            "single_word": false,
            "special": true
        },
        "50254": {
            "content": "                        ",
            "lstrip": false,
            "normalized": true,
            "rstrip": false,
            "single_word": false,
            "special": false
        },
        "50255": {
            "content": "                       ",
            "lstrip": false,
            "normalized": true,
            "rstrip": false,
            "single_word": false,
            "special": false
        },
        "50256": {
            "content": "                      ",
            "lstrip": false,
            "normalized": true,
            "rstrip": false,
            "single_word": false,
            "special": false
        },
        "50257": {
            "content": "                     ",
            "lstrip": false,
            "normalized": true,
            "rstrip": false,
            "single_word": false,
            "special": false
        },
        "50258": {
            "content": "                    ",
            "lstrip": false,
            "normalized": true,
            "rstrip": false,
            "single_word": false,
            "special": false
        },
        "50259": {
            "content": "                   ",
            "lstrip": false,
            "normalized": true,
            "rstrip": false,
            "single_word": false,
            "special": false
        },
        "50260": {
            "content": "                  ",
            "lstrip": false,
            "normalized": true,
            "rstrip": false,
            "single_word": false,
            "special": false
        },
        "50261": {
            "content": "                 ",
            "lstrip": false,
            "normalized": true,
            "rstrip": false,
            "single_word": false,
            "special": false
        },
        "50262": {
            "content": "                ",
            "lstrip": false,
            "normalized": true,
            "rstrip": false,
            "single_word": false,
            "special": false
        },
        "50263": {
            "content": "               ",
            "lstrip": false,
            "normalized": true,
            "rstrip": false,
            "single_word": false,
            "special": false
        },
        "50264": {
            "content": "              ",
            "lstrip": false,
            "normalized": true,
            "rstrip": false,
            "single_word": false,
            "special": false
        },
        "50265": {
            "content": "             ",
            "lstrip": false,
            "normalized": true,
            "rstrip": false,
            "single_word": false,
            "special": false
        },
        "50266": {
            "content": "            ",
            "lstrip": false,
            "normalized": true,
            "rstrip": false,
            "single_word": false,
            "special": false
        },
        "50267": {
            "content": "           ",
            "lstrip": false,
            "normalized": true,
            "rstrip": false,
            "single_word": false,
            "special": false
        },
        "50268": {
            "content": "          ",
            "lstrip": false,
            "normalized": true,
            "rstrip": false,
            "single_word": false,
            "special": false
        },
        "50269": {
            "content": "         ",
            "lstrip": false,
            "normalized": true,
            "rstrip": false,
            "single_word": false,
            "special": false
        },
        "50270": {
            "content": "        ",
            "lstrip": false,
            "normalized": true,
            "rstrip": false,
            "single_word": false,
            "special": false
        },
        "50271": {
            "content": "       ",
            "lstrip": false,
            "normalized": true,
            "rstrip": false,
            "single_word": false,
            "special": false
        },
        "50272": {
            "content": "      ",
            "lstrip": false,
            "normalized": true,
            "rstrip": false,
            "single_word": false,
            "special": false
        },
        "50273": {
            "content": "     ",
            "lstrip": false,
            "normalized": true,
            "rstrip": false,
            "single_word": false,
            "special": false
        },
        "50274": {
            "content": "    ",
            "lstrip": false,
            "normalized": true,
            "rstrip": false,
            "single_word": false,
            "special": false
        },
        "50275": {
            "content": "   ",
            "lstrip": false,
            "normalized": true,
            "rstrip": false,
            "single_word": false,
            "special": false
        },
        "50276": {
            "content": "  ",
            "lstrip": false,
            "normalized": true,
            "rstrip": false,
            "single_word": false,
            "special": false
        },
        "50277": {
            "content": "<|im_start|>",
            "lstrip": false,
            "normalized": false,
            "rstrip": false,
            "single_word": false,
            "special": true
        },
        "50278": {
            "content": "<|im_end|>",
            "lstrip": false,
            "normalized": false,
            "rstrip": false,
            "single_word": false,
            "special": true
        }
    },
    "additional_special_tokens": [
        "<|im_start|>",
        "<|im_end|>"
    ],
    "bos_token": "<|endoftext|>",
    "chat_template": "{% if messages[0]['role'] == 'system' %}{% set loop_messages = messages[1:] %}{% set system_message = messages[0]['content'] %}{% elif not 'system' in messages[0]['role'] %}{% set loop_messages = messages %}{% set system_message = 'A conversation between a user and an LLM-based AI assistant. The assistant gives helpful and honest answers.' %}{% else %}{% set loop_messages = messages %}{% set system_message = false %}{% endif %}{% for message in loop_messages %}{% if loop.index0 == 0 %}{% if system_message != false %}{{ '<|im_start|>system\n' + system_message.strip() + '\n'}}{% endif %}{{ '<|im_start|>' + message['role'] + '\n' + message['content'] + '<|im_end|>' }}{% else %}{{ '\n' + '<|im_start|>' + message['role'] + '\n' + message['content'] + '<|im_end|>' }}{% endif %}{% if (add_generation_prompt == true and loop.last) %}{{ '\n' + '<|im_start|>' + 'assistant' + '\n' }}{% elif (message['role'] == 'assistant') %}{% endif %}{% endfor %}",
    "clean_up_tokenization_spaces": true,
    "eos_token": "<|endoftext|>",
    "extra_special_tokens": {},
    "model_max_length": 2048,
    "pad_token": "<|endoftext|>",
    "tokenizer_class": "GPTNeoXTokenizer",
    "unk_token": "<|endoftext|>"
}
