{"add_prefix_space": false, "bos_token": "<|endoftext|>", "clean_up_tokenization_spaces": true, "eos_token": "<|endoftext|>", "model_max_length": 1000000000000000019884624838656, "tokenizer_class": "GPTNeoXTokenizer", "unk_token": "<|endoftext|>"}